/*
 * =====================================================================================
 *
 *       Filename:  2-1.c
 *
 *    Description:  
 *    				完成下列数字转换
 *    				A. 将0x39a7f8转为二进制
 *    				B. 将二进制1100100101111011转为十六进制
 *    				C. 将0xd5ec4转为二进制
 *    				D. 将二进制10011011100111101110101转为十六进制
 *
 *        Version:  1.0
 *        Created:  2013年11月07日 21时56分02秒
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  htyuan (htyuan), htyuan80@gmail.com
 *        Company:  aibang
 *
 * =====================================================================================
 */

A.
001110011010011111111000
B.
0X647B (从右向左四位分割)
C.
11010101111011000100
D.
100 1101 1100 1111 0111 0101  ===> 0X4DCF75
